In [ ]:
mport numpy as np
import pandas as pd

import scipy.stats as stats

In [2]:
import pandas as pd
data = pd.read_csv("C:\Advertising.csv")
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [3]:
#dataset details

In [11]:
data.shape

(200, 5)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [13]:
data.isnull().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

In [ ]:
# cleaning the data

In [15]:
data1 = data.drop(["Unnamed: 0"], axis = 1)
data1

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [ ]:
#to find average, mean,median,percentile

In [17]:
data1.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [ ]:
1)The average money spend for TV advertising with the highest mean of 147
2)The median is highest for TV advertising with  149.7
3)The maximum amount spend was also for TV with 196.4

In [ ]:
# Anova test

In [ ]:
H0: same amount  spent for three advertisements
H1: same amount was not spent for the three advertisements

In [9]:
import scipy.stats as stats
fvalue,pvalue = stats.f_oneway(data['TV'],data['Radio'],data['Newspaper'])
print(fvalue,pvalue)

358.8514595342597 4.552931539744962e-103

In [10]:
alpha = 0.05
if pvalue > alpha:
   print("Accept the null hypothesis")
elif pvalue < alpha:
    print("Reject the null hypothesis")

Reject the null hypothesis

In [ ]:
#conclusion

In [ ]:
1)As the pvalue is less than 0.05,we reject the null hypothesis and accept the alternate hypothesis ,same amount was not spent 
for the three advertisements.Different amount was spent for the three advertisements.
2)By the analysis it is seen that most amount of money for advertising was spend for TV.